[{"title":"University Students Take Top Honors at CME Group’s Annual Trading Challenge","imagelink":"http:\/\/ftper.newsusa.com\/Thumbnail\/ChallengeWinner.jpg","shorttext":"\n\t\t\t\t\t(NewsUSA) – For college students who aspire to work in financial markets, there is no better way to experience trading than participating in CME Group’s annual Trading Challenge.\n \tThis year, students at Rutgers University in New Brunswick, N.J., beat out nearly 6...","id":30548},{"title":"Seniors Find That Doing Good Is Good For You","imagelink":"http:\/\/ftper.newsusa.com\/Thumbnail\/SeniorsVolunteering.jpg","shorttext":"\n\t\t\t\t\t(NewsUSA) – There are two things that older adults have in spades these days: time and knowledge. And both make them the perfect match for volunteering.\n\tBy giving back as little as two hours a week, or about 96 hours a year, older adults are discovering how to ke...","id":30546},{"title":"Chiropractic Care Offers Drug-Free Pain Relief for Back Pain Sufferers","imagelink":"http:\/\/www.copyrightfreecontent.com\/wp-content\/uploads\/2017\/03\/CPRBackPainC_SOC-300x200.jpg","shorttext":"\n\t\t\t\t\t\nLower back pain can be a short-term or chronic problem that can strike anyone of any age at any time. Whether you have a desk job or are on your feet all day, you are likely to experience an episode of lower back pain at some point in your life, along with tens o...","id":30543},{"title":"Telecom and Cloud Service Options Expand in Africa","imagelink":"http:\/\/ftper.newsusa.com\/Thumbnail\/ArtiliumAfrica.jpg","shorttext":"\n\t\t\t\t\t(NewsUSA) – Affordable mobile telecommunications in Africa are expanding through a joint venture between two Virginia-based companies.\n\t“Our 20-20-20 goal is to serve 20 million Africans in 20 countries by 2020,” says Paul Delkaso, managing member of the Virginia-...","id":30527},{"title":"Depression Sufferers Find Hope With New Sound Technology","imagelink":"http:\/\/ftper.newsusa.com\/Thumbnail\/SoundTechnology.jpg","shorttext":"\n\t\t\t\t\t(NewsUSA) – Healthcare in the United States is one of the hottest topics of conversation these days, in large part, because there are no easy answers on how to affordably offer it to everyone.\n\tWith the cost of healthcare continuing to skyrocket, it’s no surprise...","id":30529},{"title":"Going With Your Gut — Virtual Colonoscopy Simplifies Cancer Screening","imagelink":"http:\/\/ftper.newsusa.com\/Thumbnail\/ACRColonoscopy.jpg","shorttext":"\n\t\t\t\t\t(NewsUSA) -Did you know that colorectal cancer is expected to kill more than 50,000 American men and women this year?\n\tBut there is hope.\n\tColorectal cancer is often preventable. According to the American Cancer Society (ACS), nearly all of these cancers start as...","id":30531},{"title":"Amid Opioid Abuse Crisis, Back Pain Sufferers Look to Chiropractic Care","imagelink":"http:\/\/ftper.newsusa.com\/Thumbnail\/CPRBackPain.jpg","shorttext":"\n\t\t\t\t\t(NewsUSA) – Lower back pain, it’s been said, is very democratic.\n\tMeaning, tens of millions of people of all stripes — from truck drivers to stock brokers — experience it at some point in their lives,  and the worst cases can be positively debilitating.\n\t“You’d be...","id":30511},{"title":"Entrepreneurs Provide TIPS! Monthly Yield Now Makes Sense","imagelink":"http:\/\/ftper.newsusa.com\/Thumbnail\/EntrexMarketIndex.jpg","shorttext":"\n\t\t\t\t\t(NewsUSA) -The ability to invest in cash-flowing and profitable entrepreneurs has disappeared with the loss of the regional exchanges in Philadelphia, Chicago and Seattle, among others. Local investors have lost the ability to invest locally — easily.\n\tThe Entrex...","id":30509},{"title":"How an Ex-College Athlete Survived His Use of Prescription Painkillers","imagelink":"http:\/\/ftper.newsusa.com\/Thumbnail\/imagena.gif","shorttext":"\n\t\t\t\t\t(NewsUSA) – Pro sports stars may grab all the headlines, but college and high-school athletes also suffer from the negative effects of prescription painkillers.\nOne man tells how chiropractic care helped turn his life around.\nWatch the video at: https:\/\/youtu.be\/a...","id":30507},{"title":"Frustrated Seniors Are Often Served Meals They Dislike Or Can’t Tolerate","imagelink":"http:\/\/ftper.newsusa.com\/Thumbnail\/TopChefMeals.jpg","shorttext":"\n\t\t\t\t\t(ZD360) – Anyone who has aging parents knows how frustrating it can be to get them to eat — never mind eat well.Experts say that the reason for this \"fickleness,\" is lack of control over their food choices as they begin to lose their independence. In addition, as...","id":30491}]